app/Models/ProductModel.php

SELECT *
FROM `products`
WHERE `status` = 'active'
 LIMIT 5
SELECT COUNT(*) AS `numrows`
FROM `products`
WHERE `status` = 'active'
---
    public function getProductsPaginated($perPage = 10)
    {
        return $this->where('status', 'active')->paginate($perPage);

SELECT *
FROM `products`
WHERE `status` = 'active'
AND   (
`product_name` LIKE '%1231%' ESCAPE '!'
OR  `description` LIKE '%1231%' ESCAPE '!'
 )
 LIMIT 5
SELECT COUNT(*) AS `numrows`
FROM `products`
WHERE `status` = 'active'
AND   (
`product_name` LIKE '%1231%' ESCAPE '!'
OR  `description` LIKE '%1231%' ESCAPE '!'
 )
---
    public function searchProducts($keyword, $perPage = 10)
    {
        return $this->where('status', 'active')
                    ->groupStart()
                    ->like('product_name', $keyword)
                    ->orLike('description', $keyword)
                    ->groupEnd()
                    ->paginate($perPage);

SELECT COUNT(*) AS `numrows`
FROM `products`
WHERE `status` = 'active'
---
    public function getTotalProducts()
    {
        return $this->where('status', 'active')->countAllResults(false);

SELECT COUNT(*) AS `numrows`
FROM `products`
WHERE `status` = 'deleted'
---
    public function getDeletedProductsCount()
    {
        return $this->where('status', 'deleted')->countAllResults(false);

SELECT *
FROM `products`
WHERE `status` = 'deleted'
 LIMIT 10
SELECT COUNT(*) AS `numrows`
FROM `products`
WHERE `status` = 'deleted'
---
    public function getDeletedProducts($perPage = 10)
    {
        return $this->where('status', 'deleted')->paginate($perPage);